app/controllers/industries_controller.rb

SELECT * FROM "industries"
---
  def index
    @industries = Industry.all

SELECT * FROM "industries" WHERE ("industries"."id" = 1)
---
  def show
    @industry = Industry.find(params[:id])

SELECT * FROM "industries" WHERE ("industries"."id" = 5)
---
  def edit
    @industry = Industry.find(params[:id])

INSERT INTO "industries" ("name", "created_at", "updated_at", "description") VALUES('test', '2010-12-08 15:47:04', '2010-12-08 15:47:04', 'sdfa')
---
  def create
    @industry = Industry.new(params[:industry])

    respond_to do |format|
      if @industry.save

DELETE FROM "industries" WHERE "id" = 2
SELECT * FROM "industries" WHERE ("industries"."id" = 2)
---
  def destroy
    if params[:industry_ids]
      Industry.destroy(params[:industry_ids])
    else
      @industry = Industry.find(params[:id])